#encoding=utf-8
from random import randint
list1=["单词搜索","分割字符串","全排列--回溯","全排列-动规","最长递增子序列-回溯","最长递增子序列-动规",\
       "最长回文子序列","一和零","股票的最大利润","最长公共子序列","分割等和子集","零钱兑换"]
hot100=["48旋转图像","75颜色分类","55跳跃游戏","198打家劫舍","102二叉树层序遍历"
       ,"数组中的第K个最大元素","前K个高频元素","206反转链表","287寻找重复数"]
print(list1[randint(0,len(list1))])

#102二叉树层序遍历:
# 输入：[3,9,20,null,null,15,7]
# 输出
# [[3],
#  [9,20],
#  [15,7]]

#206 反转链表
#函数名：def reverseList(self, head: ListNode) -> ListNode:
#输入: 1->2->3->4->5->NULL
#输出: 5->4->3->2->1->NULL
